<html>
    <head>

    </head>
    <body>

        <h1>matrix.lib</h1>

        <p>Набор библиотек для обработки учебной документации основных профессиональных образовательных программ.
        <p>Версия 1.0
        <p>Примеры данных для обработки: <a href="samples.zip">скачать</a><br />
        Все файлы проекта: <a href="https://github.com/alexey-sergeev/matrix.lib">посмотреть и скачать</a></p>
 
        <p><strong>Универсальные модули</strong></p>

        <ul>
            <li>
                <a href="parser.php">Парсер</a>
                <p>Перерабатывает текстовое описание чего-либо в струрктурированный массив</p>
            </li>
            <li>
                <a href="cmp.php">Компетенции</a>
                <p>Разные действия с наборами компетенций</p>
            </li>
        </ul>

        <p><strong>Обработка разных частей ОПОП</strong></p>

        <ul>
            <li><a href="modules.php">Модули и дисциплины</a></li>
            <li><a href="matrix.php">Матрица компетенций</a></li>
            <li>
                <a href="curriculum.php">Учебный план</a>
                <p>Простое построение на основе данных учебного плана</p>
            </li>
            
            <li><a href="content.php">Цели и содержание</a></li>
            <li><a href="parts.php">Описание разделов</a></li>
            <li>
                <a href="assessments.php">Оценочные средства</a>
                <p>Построение с учетом описания и данных учебного плана</p>
            </li>

            <li><a href="biblio.php">Списки литературы</a></li>
            <li><a href="it.php">Информационные технологии</a></li>
            <li><a href="mto.php">Материально-техническое обеспечение</a></li>
            <li>
                <a href="authors.php">Списки разработчиков</a>
                <p>Обработка по дисциплинам с возможностью группировки по серии дисциплин</p>
            </li>
        </ul>

        <p><strong>Сервисные модули</strong></p>

        <ul>
            <li>
                <a href="ordering.php">Порядок следования дисциплин</a>
                <p>Построение порядка следования связанных дисциплин</p>
            </li>
            <li>
                <a href="guidelines.php">Методические указания</a>
                <p>Оформление методических указаний по видам занятий дисциплин</p>
            </li>
            <li>
                <a href="plx.php">Загрузка учебного плана</a>
                <p>Загрузка учебного плана из plx-файла для построения возможных текстовых описаний</p>
            </li>

        </ul>

        <p>&nbsp;

        <p>Сергеев А.Н.<br /> 
        Волгоградский государственный социально-педагогический университет<br />
        Июль-август 2019 г.<br />

        <p>&nbsp;


    </body>
</html>
